* Kendryte K230
#+PLOT: title:"K230 | Varied Network Size, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]" set:"logscale y"
#+PLOT: set:"xlabel 'Network Size (N inputs + N output)'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:1024]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|----------+----------------+----------------+----------------+------------------|
| N+N Size |           risp |          vrisp |     vrisp-full | vrisp-full/vrisp |
|----------+----------------+----------------+----------------+------------------|
|        / |              < |              < |              < |                  |
|        1 | 3411804.844763 | 2747252.747253 | 3192848.020434 |        1.1621967 |
|        2 | 1243317.170210 | 2428953.121205 | 2336448.598131 |       0.96191589 |
|        4 |  818330.605565 | 1539882.968894 | 1510574.018127 |       0.98096677 |
|        8 |  429387.264374 |  820411.846747 |  941619.585687 |        1.1477401 |
|       16 |  196216.937446 |  376180.265583 |  498802.873105 |        1.3259677 |
|       32 |   53958.678444 |  148966.914448 |  251895.513741 |        1.6909494 |
|       64 |   14084.288835 |   50695.799853 |  113058.224986 |        2.2301300 |
|      128 |    2041.307490 |   14051.002328 |   32739.654269 |        2.3300583 |
|      256 |     465.297637 |    3833.576765 |    9597.140820 |        2.5034430 |
|      512 |      98.518136 |     843.818552 |    1912.665768 |        2.2666790 |
|     1024 |      21.575642 |     204.586418 |     487.619226 |        2.3834389 |
|----------+----------------+----------------+----------------+------------------|
#+TBLFM: $5=($4/$3)

* MilkV Jupiter
** 16-bit Integer Charges
#+PLOT: title:"Jupiter | Varied Network Size, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]" set:"logscale y"
#+PLOT: set:"xlabel 'Network Size (N inputs + N output)'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:1024]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
| N+N Size |           risp |          vrisp |     vrisp-full | (vrisp - full) / vrisp |
|        1 | 2573340.195574 | 2715915.263444 | 2649006.622517 |             0.97536424 |
|        2 | 1055631.795630 | 1897893.338394 | 1875468.867217 |             0.98818455 |
|        4 |  614288.346950 | 1164415.463437 | 1207729.468599 |              1.0371981 |
|        8 |  339006.034307 |  634558.030332 |  695942.654325 |              1.0967360 |
|       16 |  162437.867516 |  309568.770702 |  374854.743787 |              1.2108933 |
|       32 |   50454.341344 |  138144.443830 |  198807.157058 |              1.4391252 |
|       64 |   15711.758366 |   52982.378061 |   87475.288231 |              1.6510261 |
|      128 |    2431.255639 |   17112.211616 |   30284.492523 |              1.7697591 |
|      256 |     374.791199 |    5065.886925 |    9648.169839 |              1.9045371 |
|      512 |      80.403055 |    1101.562522 |    1975.719201 |              1.7935607 |
|     1024 |      18.265353 |     184.778187 |     258.365233 |              1.3982453 |
#+TBLFM: $5=($4/$3)
** 16-bit Float Charges
#+PLOT: title:"Jupiter | Varied Network Size, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]" set:"logscale y"
#+PLOT: set:"xlabel 'Network Size (N inputs + N output)'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:1024]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
| N+N Size |           risp |          vrisp |     vrisp-full | (vrisp - full) / vrisp |
|        1 | 2214839.424142 | 2556237.218814 | 2615746.795710 |              1.0232801 |
|        2 | 1032951.141411 | 1633986.928105 | 1878639.864738 |              1.1497276 |
|        4 |  596089.651884 | 1039825.309348 | 1195457.262403 |              1.1496712 |
|        8 |  326328.155593 |  588235.294118 |  702938.282019 |              1.1949951 |
|       16 |  156167.036262 |  272836.407290 |  371264.154446 |              1.3607574 |
|       32 |   49835.791068 |  117069.972723 |  201061.605276 |              1.7174481 |
|       64 |   14886.512671 |   49656.131291 |   81605.340253 |              1.6434091 |
|      128 |    2399.641014 |   15827.167333 |   26293.785727 |              1.6613071 |
|      256 |     376.527175 |    4656.462495 |    8393.049883 |              1.8024519 |
|      512 |      81.093580 |    1019.103087 |    1664.017551 |              1.6328255 |
|     1024 |      18.220413 |     167.820967 |     228.230830 |              1.3599661 |
#+TBLFM: $5=($4/$3)

* Desktop Intel i5-12400F
** 8-bit Integer Charges
#+PLOT: title:"Desktop | Varied Network Size, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Network Size (N inputs + N output)'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:*]"
#+PLOT: labels:("x" "risp" "superneuro" "vrisp")
- 64 Input Neurons, 64 Output Neurons, 32 Fan-out, Random Delay 1-N
- 25% Activity, Averaged over 5000 time steps
- Fan-out describes how many output neurons each input is connected to
#+ATTR_HTML: :align center
#+CAPTION: Simulation time steps per second
|----------+-----------------+-----------------+--------------+------------------|
| N+N Size |            risp |           vrisp |   superneuro | vrisp/superneuro |
|----------+-----------------+-----------------+--------------+------------------|
|        / |               < |               < |            < |                < |
|        1 | 28011204.481793 | 28490028.490028 | 46448.544303 |        613.36752 |
|        2 | 13037809.647979 | 20533880.903491 | 46655.282778 |        440.11910 |
|        4 |  8605851.979346 | 11933174.224344 | 44478.247913 |        268.29236 |
|        8 |  2628120.893561 |  6501950.585176 | 29269.377792 |        222.14174 |
|       16 |  1571338.780641 |  2935133.548576 |  5373.868062 |        546.18638 |
|       32 |   502033.234600 |  1486325.802616 |   257.766797 |        5766.1647 |
|       64 |   215127.785905 |   501630.298470 |    18.305242 |        27403.642 |
|      128 |    69391.918617 |   145196.886979 |     1.127357 |        128794.06 |
|      256 |    15340.199607 |    43815.641308 |              |              inf |
|      512 |     3206.732599 |    12882.265114 |              |              inf |
|     1024 |      431.250368 |     3153.772259 |              |              inf |
|----------+-----------------+-----------------+--------------+------------------|
#+TBLFM: $5=($3/$4)
** 16-bit Integer Charges
| N+N Size |           risp |          vrisp |   superneuro |
|        1 | 7722007.722008 | 6978367.062107 | 46448.544303 |
|        2 | 7485029.940120 | 8298755.186722 | 46655.282778 |
|        4 | 1062699.256111 | 7733952.049497 | 44478.247913 |
|        8 |  540482.110042 | 6451612.903226 | 29269.377792 |
|       16 | 1087665.869045 | 2113271.344041 |  5373.868062 |
|       32 |  490220.108829 | 1547748.026621 |   257.766797 |
|       64 |  189645.363171 |  530701.056095 |    18.305242 |
|      128 |   69985.373057 |  162153.397114 |     1.127357 |
|      256 |   16748.819627 |   44664.990241 |       Failed |
|      512 |    3951.155812 |   12232.490719 |       Failed |
|     1024 |     494.586430 |    3009.155959 |       Failed |
** 16-bit Float Charges
| N+N Size |           risp |          vrisp |
|        1 | 5333333.333333 | 2568713.074750 |
|        2 | 3274394.237066 | 4470272.686634 |
|        4 | 2871912.693854 | 2332089.552239 |
|        8 |  776940.408671 | 1537515.375154 |
|       16 |  663614.042073 |  890075.656431 |
|       32 |  373706.042827 |  814597.588791 |
|       64 |  224931.395924 |  372869.980238 |
|      128 |   69898.786557 |  123287.840120 |
|      256 |   17601.140554 |   40602.706576 |
|      512 |    4032.303591 |   11203.941995 |
|     1024 |     501.710960 |    2956.999024 |
